frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/instance/gpio.h
/**
 * \file
 *
 * \brief Instance description for GPIO
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_GPIO_INSTANCE_
#define _SAM4L_GPIO_INSTANCE_

/* ========== Register definition for GPIO peripheral ========== */
#if (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#define REG_GPIO_GPER0             (0x400E1000) /**< \brief (GPIO) GPIO Enable Register 0 */
#define REG_GPIO_GPERS0            (0x400E1004) /**< \brief (GPIO) GPIO Enable Register - Set 0 */
#define REG_GPIO_GPERC0            (0x400E1008) /**< \brief (GPIO) GPIO Enable Register - Clear 0 */
#define REG_GPIO_GPERT0            (0x400E100C) /**< \brief (GPIO) GPIO Enable Register - Toggle 0 */
#define REG_GPIO_PMR00             (0x400E1010) /**< \brief (GPIO) Peripheral Mux Register 0 0 */
#define REG_GPIO_PMR0S0            (0x400E1014) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 0 */
#define REG_GPIO_PMR0C0            (0x400E1018) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 0 */
#define REG_GPIO_PMR0T0            (0x400E101C) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 0 */
#define REG_GPIO_PMR10             (0x400E1020) /**< \brief (GPIO) Peripheral Mux Register 1 0 */
#define REG_GPIO_PMR1S0            (0x400E1024) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 0 */
#define REG_GPIO_PMR1C0            (0x400E1028) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 0 */
#define REG_GPIO_PMR1T0            (0x400E102C) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 0 */
#define REG_GPIO_PMR20             (0x400E1030) /**< \brief (GPIO) Peripheral Mux Register 2 0 */
#define REG_GPIO_PMR2S0            (0x400E1034) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 0 */
#define REG_GPIO_PMR2C0            (0x400E1038) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 0 */
#define REG_GPIO_PMR2T0            (0x400E103C) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 0 */
#define REG_GPIO_ODER0             (0x400E1040) /**< \brief (GPIO) Output Driver Enable Register 0 */
#define REG_GPIO_ODERS0            (0x400E1044) /**< \brief (GPIO) Output Driver Enable Register - Set 0 */
#define REG_GPIO_ODERC0            (0x400E1048) /**< \brief (GPIO) Output Driver Enable Register - Clear 0 */
#define REG_GPIO_ODERT0            (0x400E104C) /**< \brief (GPIO) Output Driver Enable Register - Toggle 0 */
#define REG_GPIO_OVR0              (0x400E1050) /**< \brief (GPIO) Output Value Register 0 */
#define REG_GPIO_OVRS0             (0x400E1054) /**< \brief (GPIO) Output Value Register - Set 0 */
#define REG_GPIO_OVRC0             (0x400E1058) /**< \brief (GPIO) Output Value Register - Clear 0 */
#define REG_GPIO_OVRT0             (0x400E105C) /**< \brief (GPIO) Output Value Register - Toggle 0 */
#define REG_GPIO_PVR0              (0x400E1060) /**< \brief (GPIO) Pin Value Register 0 */
#define REG_GPIO_PUER0             (0x400E1070) /**< \brief (GPIO) Pull-up Enable Register 0 */
#define REG_GPIO_PUERS0            (0x400E1074) /**< \brief (GPIO) Pull-up Enable Register - Set 0 */
#define REG_GPIO_PUERC0            (0x400E1078) /**< \brief (GPIO) Pull-up Enable Register - Clear 0 */
#define REG_GPIO_PUERT0            (0x400E107C) /**< \brief (GPIO) Pull-up Enable Register - Toggle 0 */
#define REG_GPIO_PDER0             (0x400E1080) /**< \brief (GPIO) Pull-down Enable Register 0 */
#define REG_GPIO_PDERS0            (0x400E1084) /**< \brief (GPIO) Pull-down Enable Register - Set 0 */
#define REG_GPIO_PDERC0            (0x400E1088) /**< \brief (GPIO) Pull-down Enable Register - Clear 0 */
#define REG_GPIO_PDERT0            (0x400E108C) /**< \brief (GPIO) Pull-down Enable Register - Toggle 0 */
#define REG_GPIO_IER0              (0x400E1090) /**< \brief (GPIO) Interrupt Enable Register 0 */
#define REG_GPIO_IERS0             (0x400E1094) /**< \brief (GPIO) Interrupt Enable Register - Set 0 */
#define REG_GPIO_IERC0             (0x400E1098) /**< \brief (GPIO) Interrupt Enable Register - Clear 0 */
#define REG_GPIO_IERT0             (0x400E109C) /**< \brief (GPIO) Interrupt Enable Register - Toggle 0 */
#define REG_GPIO_IMR00             (0x400E10A0) /**< \brief (GPIO) Interrupt Mode Register 0 0 */
#define REG_GPIO_IMR0S0            (0x400E10A4) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 0 */
#define REG_GPIO_IMR0C0            (0x400E10A8) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 0 */
#define REG_GPIO_IMR0T0            (0x400E10AC) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 0 */
#define REG_GPIO_IMR10             (0x400E10B0) /**< \brief (GPIO) Interrupt Mode Register 1 0 */
#define REG_GPIO_IMR1S0            (0x400E10B4) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 0 */
#define REG_GPIO_IMR1C0            (0x400E10B8) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 0 */
#define REG_GPIO_IMR1T0            (0x400E10BC) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 0 */
#define REG_GPIO_GFER0             (0x400E10C0) /**< \brief (GPIO) Glitch Filter Enable Register 0 */
#define REG_GPIO_GFERS0            (0x400E10C4) /**< \brief (GPIO) Glitch Filter Enable Register - Set 0 */
#define REG_GPIO_GFERC0            (0x400E10C8) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 0 */
#define REG_GPIO_GFERT0            (0x400E10CC) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 0 */
#define REG_GPIO_IFR0              (0x400E10D0) /**< \brief (GPIO) Interrupt Flag Register 0 */
#define REG_GPIO_IFRC0             (0x400E10D8) /**< \brief (GPIO) Interrupt Flag Register - Clear 0 */
#define REG_GPIO_ODMER0            (0x400E10E0) /**< \brief (GPIO) Open Drain Mode Register 0 */
#define REG_GPIO_ODMERS0           (0x400E10E4) /**< \brief (GPIO) Open Drain Mode Register - Set 0 */
#define REG_GPIO_ODMERC0           (0x400E10E8) /**< \brief (GPIO) Open Drain Mode Register - Clear 0 */
#define REG_GPIO_ODMERT0           (0x400E10EC) /**< \brief (GPIO) Open Drain Mode Register - Toggle 0 */
#define REG_GPIO_ODCR00            (0x400E1100) /**< \brief (GPIO) Output Driving Capability Register 0 0 */
#define REG_GPIO_ODCR0S0           (0x400E1104) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 0 */
#define REG_GPIO_ODCR0C0           (0x400E1108) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 0 */
#define REG_GPIO_ODCR0T0           (0x400E110C) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 0 */
#define REG_GPIO_ODCR10            (0x400E1110) /**< \brief (GPIO) Output Driving Capability Register 1 0 */
#define REG_GPIO_ODCR1S0           (0x400E1114) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 0 */
#define REG_GPIO_ODCR1C0           (0x400E1118) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 0 */
#define REG_GPIO_ODCR1T0           (0x400E111C) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 0 */
#define REG_GPIO_OSRR00            (0x400E1130) /**< \brief (GPIO) Output Slew Rate Register 0 0 */
#define REG_GPIO_OSRR0S0           (0x400E1134) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 0 */
#define REG_GPIO_OSRR0C0           (0x400E1138) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 0 */
#define REG_GPIO_OSRR0T0           (0x400E113C) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 0 */
#define REG_GPIO_STER0             (0x400E1160) /**< \brief (GPIO) Schmitt Trigger Enable Register 0 */
#define REG_GPIO_STERS0            (0x400E1164) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 0 */
#define REG_GPIO_STERC0            (0x400E1168) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 0 */
#define REG_GPIO_STERT0            (0x400E116C) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 0 */
#define REG_GPIO_EVER0             (0x400E1180) /**< \brief (GPIO) Event Enable Register 0 */
#define REG_GPIO_EVERS0            (0x400E1184) /**< \brief (GPIO) Event Enable Register - Set 0 */
#define REG_GPIO_EVERC0            (0x400E1188) /**< \brief (GPIO) Event Enable Register - Clear 0 */
#define REG_GPIO_EVERT0            (0x400E118C) /**< \brief (GPIO) Event Enable Register - Toggle 0 */
#define REG_GPIO_LOCK0             (0x400E11A0) /**< \brief (GPIO) Lock Register 0 */
#define REG_GPIO_LOCKS0            (0x400E11A4) /**< \brief (GPIO) Lock Register - Set 0 */
#define REG_GPIO_LOCKC0            (0x400E11A8) /**< \brief (GPIO) Lock Register - Clear 0 */
#define REG_GPIO_LOCKT0            (0x400E11AC) /**< \brief (GPIO) Lock Register - Toggle 0 */
#define REG_GPIO_UNLOCK0           (0x400E11E0) /**< \brief (GPIO) Unlock Register 0 */
#define REG_GPIO_ASR0              (0x400E11E4) /**< \brief (GPIO) Access Status Register 0 */
#define REG_GPIO_PARAMETER0        (0x400E11F8) /**< \brief (GPIO) Parameter Register 0 */
#define REG_GPIO_VERSION0          (0x400E11FC) /**< \brief (GPIO) Version Register 0 */
#define REG_GPIO_GPER1             (0x400E1200) /**< \brief (GPIO) GPIO Enable Register 1 */
#define REG_GPIO_GPERS1            (0x400E1204) /**< \brief (GPIO) GPIO Enable Register - Set 1 */
#define REG_GPIO_GPERC1            (0x400E1208) /**< \brief (GPIO) GPIO Enable Register - Clear 1 */
#define REG_GPIO_GPERT1            (0x400E120C) /**< \brief (GPIO) GPIO Enable Register - Toggle 1 */
#define REG_GPIO_PMR01             (0x400E1210) /**< \brief (GPIO) Peripheral Mux Register 0 1 */
#define REG_GPIO_PMR0S1            (0x400E1214) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 1 */
#define REG_GPIO_PMR0C1            (0x400E1218) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 1 */
#define REG_GPIO_PMR0T1            (0x400E121C) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 1 */
#define REG_GPIO_PMR11             (0x400E1220) /**< \brief (GPIO) Peripheral Mux Register 1 1 */
#define REG_GPIO_PMR1S1            (0x400E1224) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 1 */
#define REG_GPIO_PMR1C1            (0x400E1228) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 1 */
#define REG_GPIO_PMR1T1            (0x400E122C) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 1 */
#define REG_GPIO_PMR21             (0x400E1230) /**< \brief (GPIO) Peripheral Mux Register 2 1 */
#define REG_GPIO_PMR2S1            (0x400E1234) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 1 */
#define REG_GPIO_PMR2C1            (0x400E1238) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 1 */
#define REG_GPIO_PMR2T1            (0x400E123C) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 1 */
#define REG_GPIO_ODER1             (0x400E1240) /**< \brief (GPIO) Output Driver Enable Register 1 */
#define REG_GPIO_ODERS1            (0x400E1244) /**< \brief (GPIO) Output Driver Enable Register - Set 1 */
#define REG_GPIO_ODERC1            (0x400E1248) /**< \brief (GPIO) Output Driver Enable Register - Clear 1 */
#define REG_GPIO_ODERT1            (0x400E124C) /**< \brief (GPIO) Output Driver Enable Register - Toggle 1 */
#define REG_GPIO_OVR1              (0x400E1250) /**< \brief (GPIO) Output Value Register 1 */
#define REG_GPIO_OVRS1             (0x400E1254) /**< \brief (GPIO) Output Value Register - Set 1 */
#define REG_GPIO_OVRC1             (0x400E1258) /**< \brief (GPIO) Output Value Register - Clear 1 */
#define REG_GPIO_OVRT1             (0x400E125C) /**< \brief (GPIO) Output Value Register - Toggle 1 */
#define REG_GPIO_PVR1              (0x400E1260) /**< \brief (GPIO) Pin Value Register 1 */
#define REG_GPIO_PUER1             (0x400E1270) /**< \brief (GPIO) Pull-up Enable Register 1 */
#define REG_GPIO_PUERS1            (0x400E1274) /**< \brief (GPIO) Pull-up Enable Register - Set 1 */
#define REG_GPIO_PUERC1            (0x400E1278) /**< \brief (GPIO) Pull-up Enable Register - Clear 1 */
#define REG_GPIO_PUERT1            (0x400E127C) /**< \brief (GPIO) Pull-up Enable Register - Toggle 1 */
#define REG_GPIO_PDER1             (0x400E1280) /**< \brief (GPIO) Pull-down Enable Register 1 */
#define REG_GPIO_PDERS1            (0x400E1284) /**< \brief (GPIO) Pull-down Enable Register - Set 1 */
#define REG_GPIO_PDERC1            (0x400E1288) /**< \brief (GPIO) Pull-down Enable Register - Clear 1 */
#define REG_GPIO_PDERT1            (0x400E128C) /**< \brief (GPIO) Pull-down Enable Register - Toggle 1 */
#define REG_GPIO_IER1              (0x400E1290) /**< \brief (GPIO) Interrupt Enable Register 1 */
#define REG_GPIO_IERS1             (0x400E1294) /**< \brief (GPIO) Interrupt Enable Register - Set 1 */
#define REG_GPIO_IERC1             (0x400E1298) /**< \brief (GPIO) Interrupt Enable Register - Clear 1 */
#define REG_GPIO_IERT1             (0x400E129C) /**< \brief (GPIO) Interrupt Enable Register - Toggle 1 */
#define REG_GPIO_IMR01             (0x400E12A0) /**< \brief (GPIO) Interrupt Mode Register 0 1 */
#define REG_GPIO_IMR0S1            (0x400E12A4) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 1 */
#define REG_GPIO_IMR0C1            (0x400E12A8) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 1 */
#define REG_GPIO_IMR0T1            (0x400E12AC) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 1 */
#define REG_GPIO_IMR11             (0x400E12B0) /**< \brief (GPIO) Interrupt Mode Register 1 1 */
#define REG_GPIO_IMR1S1            (0x400E12B4) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 1 */
#define REG_GPIO_IMR1C1            (0x400E12B8) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 1 */
#define REG_GPIO_IMR1T1            (0x400E12BC) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 1 */
#define REG_GPIO_GFER1             (0x400E12C0) /**< \brief (GPIO) Glitch Filter Enable Register 1 */
#define REG_GPIO_GFERS1            (0x400E12C4) /**< \brief (GPIO) Glitch Filter Enable Register - Set 1 */
#define REG_GPIO_GFERC1            (0x400E12C8) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 1 */
#define REG_GPIO_GFERT1            (0x400E12CC) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 1 */
#define REG_GPIO_IFR1              (0x400E12D0) /**< \brief (GPIO) Interrupt Flag Register 1 */
#define REG_GPIO_IFRC1             (0x400E12D8) /**< \brief (GPIO) Interrupt Flag Register - Clear 1 */
#define REG_GPIO_ODMER1            (0x400E12E0) /**< \brief (GPIO) Open Drain Mode Register 1 */
#define REG_GPIO_ODMERS1           (0x400E12E4) /**< \brief (GPIO) Open Drain Mode Register - Set 1 */
#define REG_GPIO_ODMERC1           (0x400E12E8) /**< \brief (GPIO) Open Drain Mode Register - Clear 1 */
#define REG_GPIO_ODMERT1           (0x400E12EC) /**< \brief (GPIO) Open Drain Mode Register - Toggle 1 */
#define REG_GPIO_ODCR01            (0x400E1300) /**< \brief (GPIO) Output Driving Capability Register 0 1 */
#define REG_GPIO_ODCR0S1           (0x400E1304) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 1 */
#define REG_GPIO_ODCR0C1           (0x400E1308) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 1 */
#define REG_GPIO_ODCR0T1           (0x400E130C) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 1 */
#define REG_GPIO_ODCR11            (0x400E1310) /**< \brief (GPIO) Output Driving Capability Register 1 1 */
#define REG_GPIO_ODCR1S1           (0x400E1314) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 1 */
#define REG_GPIO_ODCR1C1           (0x400E1318) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 1 */
#define REG_GPIO_ODCR1T1           (0x400E131C) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 1 */
#define REG_GPIO_OSRR01            (0x400E1330) /**< \brief (GPIO) Output Slew Rate Register 0 1 */
#define REG_GPIO_OSRR0S1           (0x400E1334) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 1 */
#define REG_GPIO_OSRR0C1           (0x400E1338) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 1 */
#define REG_GPIO_OSRR0T1           (0x400E133C) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 1 */
#define REG_GPIO_STER1             (0x400E1360) /**< \brief (GPIO) Schmitt Trigger Enable Register 1 */
#define REG_GPIO_STERS1            (0x400E1364) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 1 */
#define REG_GPIO_STERC1            (0x400E1368) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 1 */
#define REG_GPIO_STERT1            (0x400E136C) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 1 */
#define REG_GPIO_EVER1             (0x400E1380) /**< \brief (GPIO) Event Enable Register 1 */
#define REG_GPIO_EVERS1            (0x400E1384) /**< \brief (GPIO) Event Enable Register - Set 1 */
#define REG_GPIO_EVERC1            (0x400E1388) /**< \brief (GPIO) Event Enable Register - Clear 1 */
#define REG_GPIO_EVERT1            (0x400E138C) /**< \brief (GPIO) Event Enable Register - Toggle 1 */
#define REG_GPIO_LOCK1             (0x400E13A0) /**< \brief (GPIO) Lock Register 1 */
#define REG_GPIO_LOCKS1            (0x400E13A4) /**< \brief (GPIO) Lock Register - Set 1 */
#define REG_GPIO_LOCKC1            (0x400E13A8) /**< \brief (GPIO) Lock Register - Clear 1 */
#define REG_GPIO_LOCKT1            (0x400E13AC) /**< \brief (GPIO) Lock Register - Toggle 1 */
#define REG_GPIO_UNLOCK1           (0x400E13E0) /**< \brief (GPIO) Unlock Register 1 */
#define REG_GPIO_ASR1              (0x400E13E4) /**< \brief (GPIO) Access Status Register 1 */
#define REG_GPIO_PARAMETER1        (0x400E13F8) /**< \brief (GPIO) Parameter Register 1 */
#define REG_GPIO_VERSION1          (0x400E13FC) /**< \brief (GPIO) Version Register 1 */
#define REG_GPIO_GPER2             (0x400E1400) /**< \brief (GPIO) GPIO Enable Register 2 */
#define REG_GPIO_GPERS2            (0x400E1404) /**< \brief (GPIO) GPIO Enable Register - Set 2 */
#define REG_GPIO_GPERC2            (0x400E1408) /**< \brief (GPIO) GPIO Enable Register - Clear 2 */
#define REG_GPIO_GPERT2            (0x400E140C) /**< \brief (GPIO) GPIO Enable Register - Toggle 2 */
#define REG_GPIO_PMR02             (0x400E1410) /**< \brief (GPIO) Peripheral Mux Register 0 2 */
#define REG_GPIO_PMR0S2            (0x400E1414) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 2 */
#define REG_GPIO_PMR0C2            (0x400E1418) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 2 */
#define REG_GPIO_PMR0T2            (0x400E141C) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 2 */
#define REG_GPIO_PMR12             (0x400E1420) /**< \brief (GPIO) Peripheral Mux Register 1 2 */
#define REG_GPIO_PMR1S2            (0x400E1424) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 2 */
#define REG_GPIO_PMR1C2            (0x400E1428) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 2 */
#define REG_GPIO_PMR1T2            (0x400E142C) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 2 */
#define REG_GPIO_PMR22             (0x400E1430) /**< \brief (GPIO) Peripheral Mux Register 2 2 */
#define REG_GPIO_PMR2S2            (0x400E1434) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 2 */
#define REG_GPIO_PMR2C2            (0x400E1438) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 2 */
#define REG_GPIO_PMR2T2            (0x400E143C) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 2 */
#define REG_GPIO_ODER2             (0x400E1440) /**< \brief (GPIO) Output Driver Enable Register 2 */
#define REG_GPIO_ODERS2            (0x400E1444) /**< \brief (GPIO) Output Driver Enable Register - Set 2 */
#define REG_GPIO_ODERC2            (0x400E1448) /**< \brief (GPIO) Output Driver Enable Register - Clear 2 */
#define REG_GPIO_ODERT2            (0x400E144C) /**< \brief (GPIO) Output Driver Enable Register - Toggle 2 */
#define REG_GPIO_OVR2              (0x400E1450) /**< \brief (GPIO) Output Value Register 2 */
#define REG_GPIO_OVRS2             (0x400E1454) /**< \brief (GPIO) Output Value Register - Set 2 */
#define REG_GPIO_OVRC2             (0x400E1458) /**< \brief (GPIO) Output Value Register - Clear 2 */
#define REG_GPIO_OVRT2             (0x400E145C) /**< \brief (GPIO) Output Value Register - Toggle 2 */
#define REG_GPIO_PVR2              (0x400E1460) /**< \brief (GPIO) Pin Value Register 2 */
#define REG_GPIO_PUER2             (0x400E1470) /**< \brief (GPIO) Pull-up Enable Register 2 */
#define REG_GPIO_PUERS2            (0x400E1474) /**< \brief (GPIO) Pull-up Enable Register - Set 2 */
#define REG_GPIO_PUERC2            (0x400E1478) /**< \brief (GPIO) Pull-up Enable Register - Clear 2 */
#define REG_GPIO_PUERT2            (0x400E147C) /**< \brief (GPIO) Pull-up Enable Register - Toggle 2 */
#define REG_GPIO_PDER2             (0x400E1480) /**< \brief (GPIO) Pull-down Enable Register 2 */
#define REG_GPIO_PDERS2            (0x400E1484) /**< \brief (GPIO) Pull-down Enable Register - Set 2 */
#define REG_GPIO_PDERC2            (0x400E1488) /**< \brief (GPIO) Pull-down Enable Register - Clear 2 */
#define REG_GPIO_PDERT2            (0x400E148C) /**< \brief (GPIO) Pull-down Enable Register - Toggle 2 */
#define REG_GPIO_IER2              (0x400E1490) /**< \brief (GPIO) Interrupt Enable Register 2 */
#define REG_GPIO_IERS2             (0x400E1494) /**< \brief (GPIO) Interrupt Enable Register - Set 2 */
#define REG_GPIO_IERC2             (0x400E1498) /**< \brief (GPIO) Interrupt Enable Register - Clear 2 */
#define REG_GPIO_IERT2             (0x400E149C) /**< \brief (GPIO) Interrupt Enable Register - Toggle 2 */
#define REG_GPIO_IMR02             (0x400E14A0) /**< \brief (GPIO) Interrupt Mode Register 0 2 */
#define REG_GPIO_IMR0S2            (0x400E14A4) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 2 */
#define REG_GPIO_IMR0C2            (0x400E14A8) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 2 */
#define REG_GPIO_IMR0T2            (0x400E14AC) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 2 */
#define REG_GPIO_IMR12             (0x400E14B0) /**< \brief (GPIO) Interrupt Mode Register 1 2 */
#define REG_GPIO_IMR1S2            (0x400E14B4) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 2 */
#define REG_GPIO_IMR1C2            (0x400E14B8) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 2 */
#define REG_GPIO_IMR1T2            (0x400E14BC) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 2 */
#define REG_GPIO_GFER2             (0x400E14C0) /**< \brief (GPIO) Glitch Filter Enable Register 2 */
#define REG_GPIO_GFERS2            (0x400E14C4) /**< \brief (GPIO) Glitch Filter Enable Register - Set 2 */
#define REG_GPIO_GFERC2            (0x400E14C8) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 2 */
#define REG_GPIO_GFERT2            (0x400E14CC) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 2 */
#define REG_GPIO_IFR2              (0x400E14D0) /**< \brief (GPIO) Interrupt Flag Register 2 */
#define REG_GPIO_IFRC2             (0x400E14D8) /**< \brief (GPIO) Interrupt Flag Register - Clear 2 */
#define REG_GPIO_ODMER2            (0x400E14E0) /**< \brief (GPIO) Open Drain Mode Register 2 */
#define REG_GPIO_ODMERS2           (0x400E14E4) /**< \brief (GPIO) Open Drain Mode Register - Set 2 */
#define REG_GPIO_ODMERC2           (0x400E14E8) /**< \brief (GPIO) Open Drain Mode Register - Clear 2 */
