frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/instance/gpio.h
#define REG_GPIO_ODMERT2           (0x400E14EC) /**< \brief (GPIO) Open Drain Mode Register - Toggle 2 */
#define REG_GPIO_ODCR02            (0x400E1500) /**< \brief (GPIO) Output Driving Capability Register 0 2 */
#define REG_GPIO_ODCR0S2           (0x400E1504) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 2 */
#define REG_GPIO_ODCR0C2           (0x400E1508) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 2 */
#define REG_GPIO_ODCR0T2           (0x400E150C) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 2 */
#define REG_GPIO_ODCR12            (0x400E1510) /**< \brief (GPIO) Output Driving Capability Register 1 2 */
#define REG_GPIO_ODCR1S2           (0x400E1514) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 2 */
#define REG_GPIO_ODCR1C2           (0x400E1518) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 2 */
#define REG_GPIO_ODCR1T2           (0x400E151C) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 2 */
#define REG_GPIO_OSRR02            (0x400E1530) /**< \brief (GPIO) Output Slew Rate Register 0 2 */
#define REG_GPIO_OSRR0S2           (0x400E1534) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 2 */
#define REG_GPIO_OSRR0C2           (0x400E1538) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 2 */
#define REG_GPIO_OSRR0T2           (0x400E153C) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 2 */
#define REG_GPIO_STER2             (0x400E1560) /**< \brief (GPIO) Schmitt Trigger Enable Register 2 */
#define REG_GPIO_STERS2            (0x400E1564) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 2 */
#define REG_GPIO_STERC2            (0x400E1568) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 2 */
#define REG_GPIO_STERT2            (0x400E156C) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 2 */
#define REG_GPIO_EVER2             (0x400E1580) /**< \brief (GPIO) Event Enable Register 2 */
#define REG_GPIO_EVERS2            (0x400E1584) /**< \brief (GPIO) Event Enable Register - Set 2 */
#define REG_GPIO_EVERC2            (0x400E1588) /**< \brief (GPIO) Event Enable Register - Clear 2 */
#define REG_GPIO_EVERT2            (0x400E158C) /**< \brief (GPIO) Event Enable Register - Toggle 2 */
#define REG_GPIO_LOCK2             (0x400E15A0) /**< \brief (GPIO) Lock Register 2 */
#define REG_GPIO_LOCKS2            (0x400E15A4) /**< \brief (GPIO) Lock Register - Set 2 */
#define REG_GPIO_LOCKC2            (0x400E15A8) /**< \brief (GPIO) Lock Register - Clear 2 */
#define REG_GPIO_LOCKT2            (0x400E15AC) /**< \brief (GPIO) Lock Register - Toggle 2 */
#define REG_GPIO_UNLOCK2           (0x400E15E0) /**< \brief (GPIO) Unlock Register 2 */
#define REG_GPIO_ASR2              (0x400E15E4) /**< \brief (GPIO) Access Status Register 2 */
#define REG_GPIO_PARAMETER2        (0x400E15F8) /**< \brief (GPIO) Parameter Register 2 */
#define REG_GPIO_VERSION2          (0x400E15FC) /**< \brief (GPIO) Version Register 2 */
#else
#define REG_GPIO_GPER0             (*(RwReg  *)0x400E1000UL) /**< \brief (GPIO) GPIO Enable Register 0 */
#define REG_GPIO_GPERS0            (*(WoReg  *)0x400E1004UL) /**< \brief (GPIO) GPIO Enable Register - Set 0 */
#define REG_GPIO_GPERC0            (*(WoReg  *)0x400E1008UL) /**< \brief (GPIO) GPIO Enable Register - Clear 0 */
#define REG_GPIO_GPERT0            (*(WoReg  *)0x400E100CUL) /**< \brief (GPIO) GPIO Enable Register - Toggle 0 */
#define REG_GPIO_PMR00             (*(RwReg  *)0x400E1010UL) /**< \brief (GPIO) Peripheral Mux Register 0 0 */
#define REG_GPIO_PMR0S0            (*(WoReg  *)0x400E1014UL) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 0 */
#define REG_GPIO_PMR0C0            (*(WoReg  *)0x400E1018UL) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 0 */
#define REG_GPIO_PMR0T0            (*(WoReg  *)0x400E101CUL) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 0 */
#define REG_GPIO_PMR10             (*(RwReg  *)0x400E1020UL) /**< \brief (GPIO) Peripheral Mux Register 1 0 */
#define REG_GPIO_PMR1S0            (*(WoReg  *)0x400E1024UL) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 0 */
#define REG_GPIO_PMR1C0            (*(WoReg  *)0x400E1028UL) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 0 */
#define REG_GPIO_PMR1T0            (*(WoReg  *)0x400E102CUL) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 0 */
#define REG_GPIO_PMR20             (*(RwReg  *)0x400E1030UL) /**< \brief (GPIO) Peripheral Mux Register 2 0 */
#define REG_GPIO_PMR2S0            (*(WoReg  *)0x400E1034UL) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 0 */
#define REG_GPIO_PMR2C0            (*(WoReg  *)0x400E1038UL) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 0 */
#define REG_GPIO_PMR2T0            (*(WoReg  *)0x400E103CUL) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 0 */
#define REG_GPIO_ODER0             (*(RwReg  *)0x400E1040UL) /**< \brief (GPIO) Output Driver Enable Register 0 */
#define REG_GPIO_ODERS0            (*(WoReg  *)0x400E1044UL) /**< \brief (GPIO) Output Driver Enable Register - Set 0 */
#define REG_GPIO_ODERC0            (*(WoReg  *)0x400E1048UL) /**< \brief (GPIO) Output Driver Enable Register - Clear 0 */
#define REG_GPIO_ODERT0            (*(WoReg  *)0x400E104CUL) /**< \brief (GPIO) Output Driver Enable Register - Toggle 0 */
#define REG_GPIO_OVR0              (*(RwReg  *)0x400E1050UL) /**< \brief (GPIO) Output Value Register 0 */
#define REG_GPIO_OVRS0             (*(WoReg  *)0x400E1054UL) /**< \brief (GPIO) Output Value Register - Set 0 */
#define REG_GPIO_OVRC0             (*(WoReg  *)0x400E1058UL) /**< \brief (GPIO) Output Value Register - Clear 0 */
#define REG_GPIO_OVRT0             (*(WoReg  *)0x400E105CUL) /**< \brief (GPIO) Output Value Register - Toggle 0 */
#define REG_GPIO_PVR0              (*(RoReg  *)0x400E1060UL) /**< \brief (GPIO) Pin Value Register 0 */
#define REG_GPIO_PUER0             (*(RwReg  *)0x400E1070UL) /**< \brief (GPIO) Pull-up Enable Register 0 */
#define REG_GPIO_PUERS0            (*(WoReg  *)0x400E1074UL) /**< \brief (GPIO) Pull-up Enable Register - Set 0 */
#define REG_GPIO_PUERC0            (*(WoReg  *)0x400E1078UL) /**< \brief (GPIO) Pull-up Enable Register - Clear 0 */
#define REG_GPIO_PUERT0            (*(WoReg  *)0x400E107CUL) /**< \brief (GPIO) Pull-up Enable Register - Toggle 0 */
#define REG_GPIO_PDER0             (*(RwReg  *)0x400E1080UL) /**< \brief (GPIO) Pull-down Enable Register 0 */
#define REG_GPIO_PDERS0            (*(WoReg  *)0x400E1084UL) /**< \brief (GPIO) Pull-down Enable Register - Set 0 */
#define REG_GPIO_PDERC0            (*(WoReg  *)0x400E1088UL) /**< \brief (GPIO) Pull-down Enable Register - Clear 0 */
#define REG_GPIO_PDERT0            (*(WoReg  *)0x400E108CUL) /**< \brief (GPIO) Pull-down Enable Register - Toggle 0 */
#define REG_GPIO_IER0              (*(RwReg  *)0x400E1090UL) /**< \brief (GPIO) Interrupt Enable Register 0 */
#define REG_GPIO_IERS0             (*(WoReg  *)0x400E1094UL) /**< \brief (GPIO) Interrupt Enable Register - Set 0 */
#define REG_GPIO_IERC0             (*(WoReg  *)0x400E1098UL) /**< \brief (GPIO) Interrupt Enable Register - Clear 0 */
#define REG_GPIO_IERT0             (*(WoReg  *)0x400E109CUL) /**< \brief (GPIO) Interrupt Enable Register - Toggle 0 */
#define REG_GPIO_IMR00             (*(RwReg  *)0x400E10A0UL) /**< \brief (GPIO) Interrupt Mode Register 0 0 */
#define REG_GPIO_IMR0S0            (*(WoReg  *)0x400E10A4UL) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 0 */
#define REG_GPIO_IMR0C0            (*(WoReg  *)0x400E10A8UL) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 0 */
#define REG_GPIO_IMR0T0            (*(WoReg  *)0x400E10ACUL) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 0 */
#define REG_GPIO_IMR10             (*(RwReg  *)0x400E10B0UL) /**< \brief (GPIO) Interrupt Mode Register 1 0 */
#define REG_GPIO_IMR1S0            (*(WoReg  *)0x400E10B4UL) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 0 */
#define REG_GPIO_IMR1C0            (*(WoReg  *)0x400E10B8UL) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 0 */
#define REG_GPIO_IMR1T0            (*(WoReg  *)0x400E10BCUL) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 0 */
#define REG_GPIO_GFER0             (*(RwReg  *)0x400E10C0UL) /**< \brief (GPIO) Glitch Filter Enable Register 0 */
#define REG_GPIO_GFERS0            (*(WoReg  *)0x400E10C4UL) /**< \brief (GPIO) Glitch Filter Enable Register - Set 0 */
#define REG_GPIO_GFERC0            (*(WoReg  *)0x400E10C8UL) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 0 */
#define REG_GPIO_GFERT0            (*(WoReg  *)0x400E10CCUL) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 0 */
#define REG_GPIO_IFR0              (*(RoReg  *)0x400E10D0UL) /**< \brief (GPIO) Interrupt Flag Register 0 */
#define REG_GPIO_IFRC0             (*(WoReg  *)0x400E10D8UL) /**< \brief (GPIO) Interrupt Flag Register - Clear 0 */
#define REG_GPIO_ODMER0            (*(RwReg  *)0x400E10E0UL) /**< \brief (GPIO) Open Drain Mode Register 0 */
#define REG_GPIO_ODMERS0           (*(WoReg  *)0x400E10E4UL) /**< \brief (GPIO) Open Drain Mode Register - Set 0 */
#define REG_GPIO_ODMERC0           (*(WoReg  *)0x400E10E8UL) /**< \brief (GPIO) Open Drain Mode Register - Clear 0 */
#define REG_GPIO_ODMERT0           (*(WoReg  *)0x400E10ECUL) /**< \brief (GPIO) Open Drain Mode Register - Toggle 0 */
#define REG_GPIO_ODCR00            (*(RwReg  *)0x400E1100UL) /**< \brief (GPIO) Output Driving Capability Register 0 0 */
#define REG_GPIO_ODCR0S0           (*(RwReg  *)0x400E1104UL) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 0 */
#define REG_GPIO_ODCR0C0           (*(RwReg  *)0x400E1108UL) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 0 */
#define REG_GPIO_ODCR0T0           (*(RwReg  *)0x400E110CUL) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 0 */
#define REG_GPIO_ODCR10            (*(RwReg  *)0x400E1110UL) /**< \brief (GPIO) Output Driving Capability Register 1 0 */
#define REG_GPIO_ODCR1S0           (*(RwReg  *)0x400E1114UL) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 0 */
#define REG_GPIO_ODCR1C0           (*(RwReg  *)0x400E1118UL) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 0 */
#define REG_GPIO_ODCR1T0           (*(RwReg  *)0x400E111CUL) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 0 */
#define REG_GPIO_OSRR00            (*(RwReg  *)0x400E1130UL) /**< \brief (GPIO) Output Slew Rate Register 0 0 */
#define REG_GPIO_OSRR0S0           (*(RwReg  *)0x400E1134UL) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 0 */
#define REG_GPIO_OSRR0C0           (*(RwReg  *)0x400E1138UL) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 0 */
#define REG_GPIO_OSRR0T0           (*(RwReg  *)0x400E113CUL) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 0 */
#define REG_GPIO_STER0             (*(RwReg  *)0x400E1160UL) /**< \brief (GPIO) Schmitt Trigger Enable Register 0 */
#define REG_GPIO_STERS0            (*(RwReg  *)0x400E1164UL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 0 */
#define REG_GPIO_STERC0            (*(RwReg  *)0x400E1168UL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 0 */
#define REG_GPIO_STERT0            (*(RwReg  *)0x400E116CUL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 0 */
#define REG_GPIO_EVER0             (*(RwReg  *)0x400E1180UL) /**< \brief (GPIO) Event Enable Register 0 */
#define REG_GPIO_EVERS0            (*(WoReg  *)0x400E1184UL) /**< \brief (GPIO) Event Enable Register - Set 0 */
#define REG_GPIO_EVERC0            (*(WoReg  *)0x400E1188UL) /**< \brief (GPIO) Event Enable Register - Clear 0 */
#define REG_GPIO_EVERT0            (*(WoReg  *)0x400E118CUL) /**< \brief (GPIO) Event Enable Register - Toggle 0 */
#define REG_GPIO_LOCK0             (*(RwReg  *)0x400E11A0UL) /**< \brief (GPIO) Lock Register 0 */
#define REG_GPIO_LOCKS0            (*(WoReg  *)0x400E11A4UL) /**< \brief (GPIO) Lock Register - Set 0 */
#define REG_GPIO_LOCKC0            (*(WoReg  *)0x400E11A8UL) /**< \brief (GPIO) Lock Register - Clear 0 */
#define REG_GPIO_LOCKT0            (*(WoReg  *)0x400E11ACUL) /**< \brief (GPIO) Lock Register - Toggle 0 */
#define REG_GPIO_UNLOCK0           (*(WoReg  *)0x400E11E0UL) /**< \brief (GPIO) Unlock Register 0 */
#define REG_GPIO_ASR0              (*(RwReg  *)0x400E11E4UL) /**< \brief (GPIO) Access Status Register 0 */
#define REG_GPIO_PARAMETER0        (*(RoReg  *)0x400E11F8UL) /**< \brief (GPIO) Parameter Register 0 */
#define REG_GPIO_VERSION0          (*(RoReg  *)0x400E11FCUL) /**< \brief (GPIO) Version Register 0 */
#define REG_GPIO_GPER1             (*(RwReg  *)0x400E1200UL) /**< \brief (GPIO) GPIO Enable Register 1 */
#define REG_GPIO_GPERS1            (*(WoReg  *)0x400E1204UL) /**< \brief (GPIO) GPIO Enable Register - Set 1 */
#define REG_GPIO_GPERC1            (*(WoReg  *)0x400E1208UL) /**< \brief (GPIO) GPIO Enable Register - Clear 1 */
#define REG_GPIO_GPERT1            (*(WoReg  *)0x400E120CUL) /**< \brief (GPIO) GPIO Enable Register - Toggle 1 */
#define REG_GPIO_PMR01             (*(RwReg  *)0x400E1210UL) /**< \brief (GPIO) Peripheral Mux Register 0 1 */
#define REG_GPIO_PMR0S1            (*(WoReg  *)0x400E1214UL) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 1 */
#define REG_GPIO_PMR0C1            (*(WoReg  *)0x400E1218UL) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 1 */
#define REG_GPIO_PMR0T1            (*(WoReg  *)0x400E121CUL) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 1 */
#define REG_GPIO_PMR11             (*(RwReg  *)0x400E1220UL) /**< \brief (GPIO) Peripheral Mux Register 1 1 */
#define REG_GPIO_PMR1S1            (*(WoReg  *)0x400E1224UL) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 1 */
#define REG_GPIO_PMR1C1            (*(WoReg  *)0x400E1228UL) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 1 */
#define REG_GPIO_PMR1T1            (*(WoReg  *)0x400E122CUL) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 1 */
#define REG_GPIO_PMR21             (*(RwReg  *)0x400E1230UL) /**< \brief (GPIO) Peripheral Mux Register 2 1 */
#define REG_GPIO_PMR2S1            (*(WoReg  *)0x400E1234UL) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 1 */
#define REG_GPIO_PMR2C1            (*(WoReg  *)0x400E1238UL) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 1 */
#define REG_GPIO_PMR2T1            (*(WoReg  *)0x400E123CUL) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 1 */
#define REG_GPIO_ODER1             (*(RwReg  *)0x400E1240UL) /**< \brief (GPIO) Output Driver Enable Register 1 */
#define REG_GPIO_ODERS1            (*(WoReg  *)0x400E1244UL) /**< \brief (GPIO) Output Driver Enable Register - Set 1 */
#define REG_GPIO_ODERC1            (*(WoReg  *)0x400E1248UL) /**< \brief (GPIO) Output Driver Enable Register - Clear 1 */
#define REG_GPIO_ODERT1            (*(WoReg  *)0x400E124CUL) /**< \brief (GPIO) Output Driver Enable Register - Toggle 1 */
#define REG_GPIO_OVR1              (*(RwReg  *)0x400E1250UL) /**< \brief (GPIO) Output Value Register 1 */
#define REG_GPIO_OVRS1             (*(WoReg  *)0x400E1254UL) /**< \brief (GPIO) Output Value Register - Set 1 */
#define REG_GPIO_OVRC1             (*(WoReg  *)0x400E1258UL) /**< \brief (GPIO) Output Value Register - Clear 1 */
#define REG_GPIO_OVRT1             (*(WoReg  *)0x400E125CUL) /**< \brief (GPIO) Output Value Register - Toggle 1 */
#define REG_GPIO_PVR1              (*(RoReg  *)0x400E1260UL) /**< \brief (GPIO) Pin Value Register 1 */
#define REG_GPIO_PUER1             (*(RwReg  *)0x400E1270UL) /**< \brief (GPIO) Pull-up Enable Register 1 */
#define REG_GPIO_PUERS1            (*(WoReg  *)0x400E1274UL) /**< \brief (GPIO) Pull-up Enable Register - Set 1 */
#define REG_GPIO_PUERC1            (*(WoReg  *)0x400E1278UL) /**< \brief (GPIO) Pull-up Enable Register - Clear 1 */
#define REG_GPIO_PUERT1            (*(WoReg  *)0x400E127CUL) /**< \brief (GPIO) Pull-up Enable Register - Toggle 1 */
#define REG_GPIO_PDER1             (*(RwReg  *)0x400E1280UL) /**< \brief (GPIO) Pull-down Enable Register 1 */
#define REG_GPIO_PDERS1            (*(WoReg  *)0x400E1284UL) /**< \brief (GPIO) Pull-down Enable Register - Set 1 */
#define REG_GPIO_PDERC1            (*(WoReg  *)0x400E1288UL) /**< \brief (GPIO) Pull-down Enable Register - Clear 1 */
#define REG_GPIO_PDERT1            (*(WoReg  *)0x400E128CUL) /**< \brief (GPIO) Pull-down Enable Register - Toggle 1 */
#define REG_GPIO_IER1              (*(RwReg  *)0x400E1290UL) /**< \brief (GPIO) Interrupt Enable Register 1 */
#define REG_GPIO_IERS1             (*(WoReg  *)0x400E1294UL) /**< \brief (GPIO) Interrupt Enable Register - Set 1 */
#define REG_GPIO_IERC1             (*(WoReg  *)0x400E1298UL) /**< \brief (GPIO) Interrupt Enable Register - Clear 1 */
#define REG_GPIO_IERT1             (*(WoReg  *)0x400E129CUL) /**< \brief (GPIO) Interrupt Enable Register - Toggle 1 */
#define REG_GPIO_IMR01             (*(RwReg  *)0x400E12A0UL) /**< \brief (GPIO) Interrupt Mode Register 0 1 */
#define REG_GPIO_IMR0S1            (*(WoReg  *)0x400E12A4UL) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 1 */
#define REG_GPIO_IMR0C1            (*(WoReg  *)0x400E12A8UL) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 1 */
#define REG_GPIO_IMR0T1            (*(WoReg  *)0x400E12ACUL) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 1 */
#define REG_GPIO_IMR11             (*(RwReg  *)0x400E12B0UL) /**< \brief (GPIO) Interrupt Mode Register 1 1 */
#define REG_GPIO_IMR1S1            (*(WoReg  *)0x400E12B4UL) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 1 */
#define REG_GPIO_IMR1C1            (*(WoReg  *)0x400E12B8UL) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 1 */
#define REG_GPIO_IMR1T1            (*(WoReg  *)0x400E12BCUL) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 1 */
#define REG_GPIO_GFER1             (*(RwReg  *)0x400E12C0UL) /**< \brief (GPIO) Glitch Filter Enable Register 1 */
#define REG_GPIO_GFERS1            (*(WoReg  *)0x400E12C4UL) /**< \brief (GPIO) Glitch Filter Enable Register - Set 1 */
#define REG_GPIO_GFERC1            (*(WoReg  *)0x400E12C8UL) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 1 */
#define REG_GPIO_GFERT1            (*(WoReg  *)0x400E12CCUL) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 1 */
#define REG_GPIO_IFR1              (*(RoReg  *)0x400E12D0UL) /**< \brief (GPIO) Interrupt Flag Register 1 */
#define REG_GPIO_IFRC1             (*(WoReg  *)0x400E12D8UL) /**< \brief (GPIO) Interrupt Flag Register - Clear 1 */
#define REG_GPIO_ODMER1            (*(RwReg  *)0x400E12E0UL) /**< \brief (GPIO) Open Drain Mode Register 1 */
#define REG_GPIO_ODMERS1           (*(WoReg  *)0x400E12E4UL) /**< \brief (GPIO) Open Drain Mode Register - Set 1 */
#define REG_GPIO_ODMERC1           (*(WoReg  *)0x400E12E8UL) /**< \brief (GPIO) Open Drain Mode Register - Clear 1 */
#define REG_GPIO_ODMERT1           (*(WoReg  *)0x400E12ECUL) /**< \brief (GPIO) Open Drain Mode Register - Toggle 1 */
#define REG_GPIO_ODCR01            (*(RwReg  *)0x400E1300UL) /**< \brief (GPIO) Output Driving Capability Register 0 1 */
#define REG_GPIO_ODCR0S1           (*(RwReg  *)0x400E1304UL) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 1 */
#define REG_GPIO_ODCR0C1           (*(RwReg  *)0x400E1308UL) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 1 */
#define REG_GPIO_ODCR0T1           (*(RwReg  *)0x400E130CUL) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 1 */
#define REG_GPIO_ODCR11            (*(RwReg  *)0x400E1310UL) /**< \brief (GPIO) Output Driving Capability Register 1 1 */
#define REG_GPIO_ODCR1S1           (*(RwReg  *)0x400E1314UL) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 1 */
#define REG_GPIO_ODCR1C1           (*(RwReg  *)0x400E1318UL) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 1 */
#define REG_GPIO_ODCR1T1           (*(RwReg  *)0x400E131CUL) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 1 */
#define REG_GPIO_OSRR01            (*(RwReg  *)0x400E1330UL) /**< \brief (GPIO) Output Slew Rate Register 0 1 */
#define REG_GPIO_OSRR0S1           (*(RwReg  *)0x400E1334UL) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 1 */
#define REG_GPIO_OSRR0C1           (*(RwReg  *)0x400E1338UL) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 1 */
#define REG_GPIO_OSRR0T1           (*(RwReg  *)0x400E133CUL) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 1 */
#define REG_GPIO_STER1             (*(RwReg  *)0x400E1360UL) /**< \brief (GPIO) Schmitt Trigger Enable Register 1 */
#define REG_GPIO_STERS1            (*(RwReg  *)0x400E1364UL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 1 */
#define REG_GPIO_STERC1            (*(RwReg  *)0x400E1368UL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 1 */
#define REG_GPIO_STERT1            (*(RwReg  *)0x400E136CUL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 1 */
#define REG_GPIO_EVER1             (*(RwReg  *)0x400E1380UL) /**< \brief (GPIO) Event Enable Register 1 */
#define REG_GPIO_EVERS1            (*(WoReg  *)0x400E1384UL) /**< \brief (GPIO) Event Enable Register - Set 1 */
#define REG_GPIO_EVERC1            (*(WoReg  *)0x400E1388UL) /**< \brief (GPIO) Event Enable Register - Clear 1 */
#define REG_GPIO_EVERT1            (*(WoReg  *)0x400E138CUL) /**< \brief (GPIO) Event Enable Register - Toggle 1 */
#define REG_GPIO_LOCK1             (*(RwReg  *)0x400E13A0UL) /**< \brief (GPIO) Lock Register 1 */
#define REG_GPIO_LOCKS1            (*(WoReg  *)0x400E13A4UL) /**< \brief (GPIO) Lock Register - Set 1 */
#define REG_GPIO_LOCKC1            (*(WoReg  *)0x400E13A8UL) /**< \brief (GPIO) Lock Register - Clear 1 */
#define REG_GPIO_LOCKT1            (*(WoReg  *)0x400E13ACUL) /**< \brief (GPIO) Lock Register - Toggle 1 */
#define REG_GPIO_UNLOCK1           (*(WoReg  *)0x400E13E0UL) /**< \brief (GPIO) Unlock Register 1 */
#define REG_GPIO_ASR1              (*(RwReg  *)0x400E13E4UL) /**< \brief (GPIO) Access Status Register 1 */
#define REG_GPIO_PARAMETER1        (*(RoReg  *)0x400E13F8UL) /**< \brief (GPIO) Parameter Register 1 */
#define REG_GPIO_VERSION1          (*(RoReg  *)0x400E13FCUL) /**< \brief (GPIO) Version Register 1 */
#define REG_GPIO_GPER2             (*(RwReg  *)0x400E1400UL) /**< \brief (GPIO) GPIO Enable Register 2 */
#define REG_GPIO_GPERS2            (*(WoReg  *)0x400E1404UL) /**< \brief (GPIO) GPIO Enable Register - Set 2 */
#define REG_GPIO_GPERC2            (*(WoReg  *)0x400E1408UL) /**< \brief (GPIO) GPIO Enable Register - Clear 2 */
#define REG_GPIO_GPERT2            (*(WoReg  *)0x400E140CUL) /**< \brief (GPIO) GPIO Enable Register - Toggle 2 */
#define REG_GPIO_PMR02             (*(RwReg  *)0x400E1410UL) /**< \brief (GPIO) Peripheral Mux Register 0 2 */
#define REG_GPIO_PMR0S2            (*(WoReg  *)0x400E1414UL) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 2 */
#define REG_GPIO_PMR0C2            (*(WoReg  *)0x400E1418UL) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 2 */
#define REG_GPIO_PMR0T2            (*(WoReg  *)0x400E141CUL) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 2 */
#define REG_GPIO_PMR12             (*(RwReg  *)0x400E1420UL) /**< \brief (GPIO) Peripheral Mux Register 1 2 */
#define REG_GPIO_PMR1S2            (*(WoReg  *)0x400E1424UL) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 2 */
#define REG_GPIO_PMR1C2            (*(WoReg  *)0x400E1428UL) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 2 */
#define REG_GPIO_PMR1T2            (*(WoReg  *)0x400E142CUL) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 2 */
