frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/instance/gpio.h
#define REG_GPIO_PMR22             (*(RwReg  *)0x400E1430UL) /**< \brief (GPIO) Peripheral Mux Register 2 2 */
#define REG_GPIO_PMR2S2            (*(WoReg  *)0x400E1434UL) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 2 */
#define REG_GPIO_PMR2C2            (*(WoReg  *)0x400E1438UL) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 2 */
#define REG_GPIO_PMR2T2            (*(WoReg  *)0x400E143CUL) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 2 */
#define REG_GPIO_ODER2             (*(RwReg  *)0x400E1440UL) /**< \brief (GPIO) Output Driver Enable Register 2 */
#define REG_GPIO_ODERS2            (*(WoReg  *)0x400E1444UL) /**< \brief (GPIO) Output Driver Enable Register - Set 2 */
#define REG_GPIO_ODERC2            (*(WoReg  *)0x400E1448UL) /**< \brief (GPIO) Output Driver Enable Register - Clear 2 */
#define REG_GPIO_ODERT2            (*(WoReg  *)0x400E144CUL) /**< \brief (GPIO) Output Driver Enable Register - Toggle 2 */
#define REG_GPIO_OVR2              (*(RwReg  *)0x400E1450UL) /**< \brief (GPIO) Output Value Register 2 */
#define REG_GPIO_OVRS2             (*(WoReg  *)0x400E1454UL) /**< \brief (GPIO) Output Value Register - Set 2 */
#define REG_GPIO_OVRC2             (*(WoReg  *)0x400E1458UL) /**< \brief (GPIO) Output Value Register - Clear 2 */
#define REG_GPIO_OVRT2             (*(WoReg  *)0x400E145CUL) /**< \brief (GPIO) Output Value Register - Toggle 2 */
#define REG_GPIO_PVR2              (*(RoReg  *)0x400E1460UL) /**< \brief (GPIO) Pin Value Register 2 */
#define REG_GPIO_PUER2             (*(RwReg  *)0x400E1470UL) /**< \brief (GPIO) Pull-up Enable Register 2 */
#define REG_GPIO_PUERS2            (*(WoReg  *)0x400E1474UL) /**< \brief (GPIO) Pull-up Enable Register - Set 2 */
#define REG_GPIO_PUERC2            (*(WoReg  *)0x400E1478UL) /**< \brief (GPIO) Pull-up Enable Register - Clear 2 */
#define REG_GPIO_PUERT2            (*(WoReg  *)0x400E147CUL) /**< \brief (GPIO) Pull-up Enable Register - Toggle 2 */
#define REG_GPIO_PDER2             (*(RwReg  *)0x400E1480UL) /**< \brief (GPIO) Pull-down Enable Register 2 */
#define REG_GPIO_PDERS2            (*(WoReg  *)0x400E1484UL) /**< \brief (GPIO) Pull-down Enable Register - Set 2 */
#define REG_GPIO_PDERC2            (*(WoReg  *)0x400E1488UL) /**< \brief (GPIO) Pull-down Enable Register - Clear 2 */
#define REG_GPIO_PDERT2            (*(WoReg  *)0x400E148CUL) /**< \brief (GPIO) Pull-down Enable Register - Toggle 2 */
#define REG_GPIO_IER2              (*(RwReg  *)0x400E1490UL) /**< \brief (GPIO) Interrupt Enable Register 2 */
#define REG_GPIO_IERS2             (*(WoReg  *)0x400E1494UL) /**< \brief (GPIO) Interrupt Enable Register - Set 2 */
#define REG_GPIO_IERC2             (*(WoReg  *)0x400E1498UL) /**< \brief (GPIO) Interrupt Enable Register - Clear 2 */
#define REG_GPIO_IERT2             (*(WoReg  *)0x400E149CUL) /**< \brief (GPIO) Interrupt Enable Register - Toggle 2 */
#define REG_GPIO_IMR02             (*(RwReg  *)0x400E14A0UL) /**< \brief (GPIO) Interrupt Mode Register 0 2 */
#define REG_GPIO_IMR0S2            (*(WoReg  *)0x400E14A4UL) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 2 */
#define REG_GPIO_IMR0C2            (*(WoReg  *)0x400E14A8UL) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 2 */
#define REG_GPIO_IMR0T2            (*(WoReg  *)0x400E14ACUL) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 2 */
#define REG_GPIO_IMR12             (*(RwReg  *)0x400E14B0UL) /**< \brief (GPIO) Interrupt Mode Register 1 2 */
#define REG_GPIO_IMR1S2            (*(WoReg  *)0x400E14B4UL) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 2 */
#define REG_GPIO_IMR1C2            (*(WoReg  *)0x400E14B8UL) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 2 */
#define REG_GPIO_IMR1T2            (*(WoReg  *)0x400E14BCUL) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 2 */
#define REG_GPIO_GFER2             (*(RwReg  *)0x400E14C0UL) /**< \brief (GPIO) Glitch Filter Enable Register 2 */
#define REG_GPIO_GFERS2            (*(WoReg  *)0x400E14C4UL) /**< \brief (GPIO) Glitch Filter Enable Register - Set 2 */
#define REG_GPIO_GFERC2            (*(WoReg  *)0x400E14C8UL) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 2 */
#define REG_GPIO_GFERT2            (*(WoReg  *)0x400E14CCUL) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 2 */
#define REG_GPIO_IFR2              (*(RoReg  *)0x400E14D0UL) /**< \brief (GPIO) Interrupt Flag Register 2 */
#define REG_GPIO_IFRC2             (*(WoReg  *)0x400E14D8UL) /**< \brief (GPIO) Interrupt Flag Register - Clear 2 */
#define REG_GPIO_ODMER2            (*(RwReg  *)0x400E14E0UL) /**< \brief (GPIO) Open Drain Mode Register 2 */
#define REG_GPIO_ODMERS2           (*(WoReg  *)0x400E14E4UL) /**< \brief (GPIO) Open Drain Mode Register - Set 2 */
#define REG_GPIO_ODMERC2           (*(WoReg  *)0x400E14E8UL) /**< \brief (GPIO) Open Drain Mode Register - Clear 2 */
#define REG_GPIO_ODMERT2           (*(WoReg  *)0x400E14ECUL) /**< \brief (GPIO) Open Drain Mode Register - Toggle 2 */
#define REG_GPIO_ODCR02            (*(RwReg  *)0x400E1500UL) /**< \brief (GPIO) Output Driving Capability Register 0 2 */
#define REG_GPIO_ODCR0S2           (*(RwReg  *)0x400E1504UL) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 2 */
#define REG_GPIO_ODCR0C2           (*(RwReg  *)0x400E1508UL) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 2 */
#define REG_GPIO_ODCR0T2           (*(RwReg  *)0x400E150CUL) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 2 */
#define REG_GPIO_ODCR12            (*(RwReg  *)0x400E1510UL) /**< \brief (GPIO) Output Driving Capability Register 1 2 */
#define REG_GPIO_ODCR1S2           (*(RwReg  *)0x400E1514UL) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 2 */
#define REG_GPIO_ODCR1C2           (*(RwReg  *)0x400E1518UL) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 2 */
#define REG_GPIO_ODCR1T2           (*(RwReg  *)0x400E151CUL) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 2 */
#define REG_GPIO_OSRR02            (*(RwReg  *)0x400E1530UL) /**< \brief (GPIO) Output Slew Rate Register 0 2 */
#define REG_GPIO_OSRR0S2           (*(RwReg  *)0x400E1534UL) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 2 */
#define REG_GPIO_OSRR0C2           (*(RwReg  *)0x400E1538UL) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 2 */
#define REG_GPIO_OSRR0T2           (*(RwReg  *)0x400E153CUL) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 2 */
#define REG_GPIO_STER2             (*(RwReg  *)0x400E1560UL) /**< \brief (GPIO) Schmitt Trigger Enable Register 2 */
#define REG_GPIO_STERS2            (*(RwReg  *)0x400E1564UL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 2 */
#define REG_GPIO_STERC2            (*(RwReg  *)0x400E1568UL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 2 */
#define REG_GPIO_STERT2            (*(RwReg  *)0x400E156CUL) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 2 */
#define REG_GPIO_EVER2             (*(RwReg  *)0x400E1580UL) /**< \brief (GPIO) Event Enable Register 2 */
#define REG_GPIO_EVERS2            (*(WoReg  *)0x400E1584UL) /**< \brief (GPIO) Event Enable Register - Set 2 */
#define REG_GPIO_EVERC2            (*(WoReg  *)0x400E1588UL) /**< \brief (GPIO) Event Enable Register - Clear 2 */
#define REG_GPIO_EVERT2            (*(WoReg  *)0x400E158CUL) /**< \brief (GPIO) Event Enable Register - Toggle 2 */
#define REG_GPIO_LOCK2             (*(RwReg  *)0x400E15A0UL) /**< \brief (GPIO) Lock Register 2 */
#define REG_GPIO_LOCKS2            (*(WoReg  *)0x400E15A4UL) /**< \brief (GPIO) Lock Register - Set 2 */
#define REG_GPIO_LOCKC2            (*(WoReg  *)0x400E15A8UL) /**< \brief (GPIO) Lock Register - Clear 2 */
#define REG_GPIO_LOCKT2            (*(WoReg  *)0x400E15ACUL) /**< \brief (GPIO) Lock Register - Toggle 2 */
#define REG_GPIO_UNLOCK2           (*(WoReg  *)0x400E15E0UL) /**< \brief (GPIO) Unlock Register 2 */
#define REG_GPIO_ASR2              (*(RwReg  *)0x400E15E4UL) /**< \brief (GPIO) Access Status Register 2 */
#define REG_GPIO_PARAMETER2        (*(RoReg  *)0x400E15F8UL) /**< \brief (GPIO) Parameter Register 2 */
#define REG_GPIO_VERSION2          (*(RoReg  *)0x400E15FCUL) /**< \brief (GPIO) Version Register 2 */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

