frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/instance/gpio.h
/* ========== Instance parameters for GPIO peripheral ========== */
#define GPIO_GFER_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_GFER_IMPLEMENTED       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_GFILTER_IMPLEMENTED    { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_GPER_DEFAULT_VAL       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_GPER_IMPLEMENTED       { 0xFFFFFFFC, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_GPIO_IRQ_MSB           11      
#define GPIO_GPIO_MAX_IRQ_MSB       11      
#define GPIO_GPIO_PADDR_BITS        11      
#define GPIO_GPIO_PINS_MSB          95      
#define GPIO_IER_DEFAULT_VAL        { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_IER_IMPLEMENTED        { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_IFE_IMPLEMENTED        { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_IFR_IMPLEMENTED        { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_IMR0_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_IMR0_IMPLEMENTED       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_IMR1_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_IMR1_IMPLEMENTED       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_INPUT_SYNC_IMPLEMENTED { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_IRQS_PER_GROUP         8       
#define GPIO_LOCK_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_LOCK_IMPLEMENTED       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_NUMBER_OF_PINS         96      
#define GPIO_ODCR0_DEFAULT_VAL      { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_ODCR0_IMPLEMENTED      { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_ODCR1_DEFAULT_VAL      { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_ODCR1_IMPLEMENTED      { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_ODER_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_ODER_IMPLEMENTED       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_ODMER_DEFAULT_VAL      { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_ODMER_IMPLEMENTED      { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_OSRR0_DEFAULT_VAL      { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_OSRR0_IMPLEMENTED      { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_OVR_DEFAULT_VAL        { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_OVR_IMPLEMENTED        { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_PADDR_MSB              10      
#define GPIO_PDATA_MSB              31      
#define GPIO_PDER_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_PDER_IMPLEMENTED       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_PMR0_DEFAULT_VAL       { 0x00000008, 0x00000000, 0x00000000 }
#define GPIO_PMR0_IMPLEMENTED       { 0xFFFFFFF4, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_PMR1_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_PMR1_IMPLEMENTED       { 0xFFFFFFF4, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_PMR2_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_PMR2_IMPLEMENTED       { 0xFFFFFFF4, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_PORT_LENGTH            3       
#define GPIO_PUER_DEFAULT_VAL       { 0x00000000, 0x00000000, 0x00000000 }
#define GPIO_PUER_IMPLEMENTED       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }
#define GPIO_STER_DEFAULT_VAL       { 0x00000004, 0x00000000, 0x00000000 }
#define GPIO_STER_IMPLEMENTED       { 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF }

#endif /* _SAM4L_GPIO_INSTANCE_ */
